In [2]:
import numpy as np
import pandas as pd
afuera = ['G1','G1','G1','G2','G2','G2']
adentro = [1,2,3,1,2,3]
indices = list(zip(afuera, adentro))
indices

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [5]:
indices = pd.MultiIndex.from_tuples(indices) #Convierte las tuplas a indices

In [6]:
indices

MultiIndex(levels=[[u'G1', u'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [7]:
type(indices)

pandas.core.indexes.multi.MultiIndex

In [11]:
from numpy.random import randn
df = pd.DataFrame(randn(6,2),indices,['A','B'])

In [12]:
df

             A         B
G1 1 -0.436399  0.564923
   2  0.127067  1.021296
   3 -1.070100 -0.927751
G2 1  1.647239  1.002973
   2  1.729183 -0.330410
   3  0.764438 -0.109806

In [13]:
df.loc['G1'].loc[1] # muestra

A   -0.436399
B    0.564923
Name: 1, dtype: float64

In [14]:
df.loc['G2'].loc[1] # muestra

A    1.647239
B    1.002973
Name: 1, dtype: float64

In [15]:
df.loc['G2'].loc[3] # muestra

A    0.764438
B   -0.109806
Name: 3, dtype: float64

In [16]:
df.loc['G2'].loc[3]['B'] # muestra

-0.10980582049139648

In [18]:
#Seccion cruzada
df.xs('G1')

          A         B
1 -0.436399  0.564923
2  0.127067  1.021296
3 -1.070100 -0.927751

In [27]:
df.xs(2,level=1)

           A         B
G1  0.127067  1.021296
G2  1.729183 -0.330410

In [23]:
df

             A         B
G1 1 -0.436399  0.564923
   2  0.127067  1.021296
   3 -1.070100 -0.927751
G2 1  1.647239  1.002973
   2  1.729183 -0.330410
   3  0.764438 -0.109806

In [33]:
#Datos perdidos
import numpy as np
import pandas as pd
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [35]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [36]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [38]:
df.dropna(thresh=2) #Elimina nan

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [39]:
df.dropna(thresh=1) #Elimina nan

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [40]:
#rellenar
df.fillna(value="rellenar")

          A         B  C
0         1         5  1
1         2  rellenar  2
2  rellenar  rellenar  3

In [43]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [44]:
df['A'].fillna(value=df['A'].mean(), inplace=True)

In [45]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [46]:
#Rellenar datos que faltan
df.fillna(value=-1,inplace=True)

In [47]:
df

     A    B  C
0  1.0  5.0  1
1  2.0 -1.0  2
2  1.5 -1.0  3

In [56]:
#Agrupar alias GroupBy
data ={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Pearson':['Sam','Jose','Amy','Ray','Carlos','Carla'],
       'Sales':[200,140,340,124,243,356]}
df= pd.DataFrame(data)

In [57]:
df

  Company Pearson  Sales
0    GOOG     Sam    200
1    GOOG    Jose    140
2    MSFT     Amy    340
3    MSFT     Ray    124
4      FB  Carlos    243
5      FB   Carla    356

In [59]:
bycom = df.groupby('Company') #Agrupa por comañia
bycom.mean()

         Sales
Company
FB       299.5
GOOG     170.0
MSFT     232.0

In [60]:
bycom.sum()

         Sales
Company
FB         599
GOOG       340
MSFT       464

In [62]:
bycom.std()

              Sales
Company
FB        79.903066
GOOG      42.426407
MSFT     152.735065

In [65]:
bycom.sum().loc['FB']

Sales    599
Name: FB, dtype: int64

In [66]:
df.groupby('Company').max()

        Pearson  Sales
Company
FB       Carlos    356
GOOG        Sam    200
MSFT        Ray    340

In [67]:
df.groupby('Company').min()

        Pearson  Sales
Company
FB        Carla    243
GOOG       Jose    140
MSFT        Amy    124

In [68]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  299.5   79.903066  243.0  271.25  299.5  327.75  356.0
GOOG      2.0  170.0   42.426407  140.0  155.00  170.0  185.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [69]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   299.500000  170.000000  232.000000
      std     79.903066   42.426407  152.735065
      min    243.000000  140.000000  124.000000
      25%    271.250000  155.000000  178.000000
      50%    299.500000  170.000000  232.000000
      75%    327.750000  185.000000  286.000000
      max    356.000000  200.000000  340.000000

In [70]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     299.500000
       std       79.903066
       min      243.000000
       25%      271.250000
       50%      299.500000
       75%      327.750000
       max      356.000000
Name: FB, dtype: float64

In [71]:
df.groupby('Company').describe().transpose()['MSFT']

Sales  count      2.000000
       mean     232.000000
       std      152.735065
       min      124.000000
       25%      178.000000
       50%      232.000000
       75%      286.000000
       max      340.000000
Name: MSFT, dtype: float64

In [76]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']},
                       index = [0,1,2,3])
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                  'B':['B4','B5','B6','B7'],
                  'C':['C4','C5','C6','C7'],
                  'D':['D4','D5','D6','D7']},
                       index = [4,5,6,7])
df3=pd.DataFrame({'A':['A8','A9','A1','A11'],
                  'B':['B8','B9','B1','B11'],
                  'C':['C8','C9','C1','C11'],
                  'D':['D8','D9','D1','D11']},
                       index = [8,9,10,11])
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10   A1   B1   C1   D1
11  A11  B11  C11  D11

In [77]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A1   B1   C1   D1
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [84]:
izquierdo = pd.DataFrame({'Key':['K0','K1','K2','K3'],
                         'A':['A0','A1','A2','A3'],
                         'B':['B0','B1','B2','B3'],})
derecho = pd.DataFrame({'Key':['K0','K1','K2','K3'],
                         'C':['C0','C1','C2','C3'],
                         'D':['D0','D1','D2','D3'],})
pd.merge(izquierdo, derecho, how='inner', on = 'Key')

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [90]:
izquierdo = pd.DataFrame({'A':['A0','A1','A2'],                          
                         'B':['B0','B1','B2'],},index=['K0','K1','K2'])
derecho = pd.DataFrame({'C':['C0','C1','C2'],
                         'D':['D0','D1','D2'],},index=['K0','K2','K3'])

In [88]:
izquierdo.join(derecho)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [101]:
df= pd.DataFrame({'col':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def', 'ghi', 'xyz']})
df.head

<bound method DataFrame.head of    col  col2 col3
0    1   444  abc
1    2   555  def
2    3   666  ghi
3    4   444  xyz>

In [94]:
df['col2'].unique()

array([444, 555, 666, 777])

In [96]:
len(df['col2'].unique())

4

In [99]:
df['col2'].nunique() #Cuenta los unicos

4

In [102]:
df['col2'].value_counts() #Cuenta los unicos

444    2
555    1
666    1
Name: col2, dtype: int64

In [105]:
def multiplica2(x): 
    return x*2
df.apply(multiplica2)

   col  col2    col3
0    2   888  abcabc
1    4  1110  defdef
2    6  1332  ghighi
3    8   888  xyzxyz

In [106]:
df.apply(lambda x:x*2)

   col  col2    col3
0    2   888  abcabc
1    4  1110  defdef
2    6  1332  ghighi
3    8   888  xyzxyz